app/views/my_schools/_my_school.html.erb

SELECT * FROM (SELECT  "MY_SCHOOLS".* FROM "MY_SCHOOLS" WHERE "MY_SCHOOLS"."USER_ID" = :a1 AND "MY_SCHOOLS"."NAME" = :a2  ORDER BY created_at DESC ) WHERE ROWNUM <= 1  [["user_id", 12], ["name", "Jefferson State Community College"]]
---
		 <%current_user.following.each do |user|%>
      <% if user.my_schools.find_by(name:my_school.name) != nil %>