app/views/general/_schoollist.html.erb

		 <div class="inline">
				 <div class="list_school_name col-md-9"><%= link_to school.Institution_Name, school_path(:id=>School.find_by(Institution_ID:school.Institution_ID).id, class:"school_name") %></div>
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."Institution_ID" = :a1 AND ROWNUM <= 1   [["Institution_ID", 100399]]