app/views/users/_mylist_form.html.erb

		<%= f.label "New School"%>
    <%= f.collection_select :school_id, School.order(:Institution_Name), :id, :Institution_Name, prompt: true %>
---
SELECT "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS"  ORDER BY "DREAMDESIGN"."SCHOOLS"."Institution_Name" ASC