app/views/majorrankings/_reviews.html.erb

SELECT "REVIEWS".* FROM "REVIEWS" WHERE "REVIEWS"."SCHOOL_ID" = :a1  [["school_id", 166]]
SELECT * FROM (SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1  ORDER BY "USERS"."ID" ASC ) WHERE ROWNUM <= 1  [["id", 347]]
---

<% @school.reviews.each do |review| %>
	<li class="review">
		<% user=User.find_by(id:review.user_id) %>