app/views/majorrankings/new.html.erb

 <% @majorrankings.each do |majorranking| %>
 <% school=School.find_by(Institution_Name:majorranking.institution_name)%>
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."Institution_Name" = :a1 AND ROWNUM <= 1   [["Institution_Name", "Carnegie Mellon University"]]

	 				<% if current_user %>
	 			 		<%= link_to "Add", addSchool_path(:user_id=>current_user.id, :school_id=>School.find_by(Institution_ID:school.Institution_ID).id, :name=> school.Institution_Name), method:"post", class:"btn btn-primary" %>
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."Institution_ID" = :a1 AND ROWNUM <= 1   [["Institution_ID", 139074]]