app/controllers/general_controller.rb

  def ranking
     @schools=School.all.paginate(page: params[:page]).limit(25)
---
SELECT COUNT(*) FROM "DREAMDESIGN"."SCHOOLS"

  def hot_ranking
    @schools=School.order(:follow).reverse_order.paginate(page: params[:page]).limit(25)
---
SELECT COUNT(*) FROM "DREAMDESIGN"."SCHOOLS"

  def add_following
    @users=User.all.paginate(page: params[:page])
---
SELECT COUNT(*) FROM "USERS"