app/controllers/majorrankings_controller.rb

SELECT  "DREAMDESIGN"."MAJORRANKINGS".* FROM "DREAMDESIGN"."MAJORRANKINGS" WHERE "DREAMDESIGN"."MAJORRANKINGS"."NAME_ABB" = :a1 AND ROWNUM <= 1   [["name_abb", "jquery"]]
---
  def show
    # respond_with(@majorrankings)
    @name=Majorranking.find_by(:name_abb=>params[:id]).name_abb

SELECT "DREAMDESIGN"."MAJORRANKINGS".* FROM "DREAMDESIGN"."MAJORRANKINGS"
---
  def new
    @majorrankings=Majorranking.all