app/controllers/my_schools_controller.rb

  def create
    @my_school = MySchool.new(my_school_params)
    @my_school.user_id = current_user.id
    @school = School.find_by id:@my_school.school_id
    @my_school.name = @school.Institution_Name
    @my_school.save
    if @my_school.save
      num = @school.follow
      num += 1
      @school.update(follow:num)
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."ID" = :a1 AND ROWNUM <= 1   [["id", 36452]]
SELECT * FROM (SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1  ORDER BY "USERS"."ID" ASC ) WHERE ROWNUM <= 1  [["id", 347]]
INSERT INTO "MY_SCHOOLS" ("COMMENT", "CREATED_AT", "ID", "NAME", "SCHOOL_ID", "UPDATED_AT", "USER_ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7)
UPDATE "DREAMDESIGN"."SCHOOLS" SET "FOLLOW" = :a1, "UPDATED_AT" = :a2 WHERE "DREAMDESIGN"."SCHOOLS"."ID" = 36452  [["follow", 1], ["updated_at", Wed, 10 Dec 2014 22:31:25 UTC +00:00]]

  def addSchool
    @my_school = MySchool.new
    @my_school.user_id = current_user.id
    @my_school.name = params[:name]
    @my_school.school_id = params[:school_id]
    @school = School.find_by id:params[:school_id]

    if @my_school.save
      num = @school.follow
      num += 1
      @school.update(follow:num)
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."ID" = :a1 AND ROWNUM <= 1   [["id", 166]]
INSERT INTO "MY_SCHOOLS" ("CREATED_AT", "ID", "NAME", "SCHOOL_ID", "UPDATED_AT", "USER_ID") VALUES (:a1, :a2, :a3, :a4, :a5, :a6)  [["created_at", 2014-12-10 22:30:14 UTC], ["id", 57], ["name", "Jefferson State Community College"], ["school_id", 166], ["updated_at", 2014-12-10 22:30:14 UTC], ["user_id", 347]]
UPDATE "DREAMDESIGN"."SCHOOLS" SET "FOLLOW" = :a1, "UPDATED_AT" = :a2 WHERE "DREAMDESIGN"."SCHOOLS"."ID" = 166  [["follow", 3], ["updated_at", Wed, 10 Dec 2014 22:30:14 UTC +00:00]]