app/controllers/relationships_controller.rb

SELECT * FROM (SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1  ORDER BY "USERS"."ID" ASC ) WHERE ROWNUM <= 1  [["id", 347]]
---
  def create
    user=User.find(params[:followed_id])

SELECT  "RELATIONSHIPS".* FROM "RELATIONSHIPS" WHERE "RELATIONSHIPS"."ID" = :a1 AND ROWNUM <= 1   [["id", 35]]
---
  def destroy
    user=Relationship.find(params[:id]).followed