app/controllers/reviews_controller.rb

  def create
    @school = School.find(params[:school_id])
    @review = Review.create(review_params)
    @review.update(user_id:current_user.id)
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."ID" = :a1 AND ROWNUM <= 1   [["id", 166]]
INSERT INTO "REVIEWS" ("BODY", "CREATED_AT", "ID", "UPDATED_AT") VALUES (:a1, :a2, :a3, :a4)  [["body", "yuuu"], ["created_at", 2014-12-10 22:29:50 UTC], ["id", 27], ["updated_at", 2014-12-10 22:29:50 UTC]]
UPDATE "REVIEWS" SET "SCHOOL_ID" = :a1, "UPDATED_AT" = :a2 WHERE "REVIEWS"."ID" = 27  [["school_id", 166], ["updated_at", Wed, 10 Dec 2014 22:29:50 UTC +00:00]]