app/controllers/schools_controller.rb

  def show
    @school = School.find(params[:id])

    @my_schools=@school.my_schools
    @users=[]
    @my_schools.each do |my_school|
      @users << User.find_by(id:my_school.user_id)
---
SELECT  "DREAMDESIGN"."SCHOOLS".* FROM "DREAMDESIGN"."SCHOOLS" WHERE "DREAMDESIGN"."SCHOOLS"."ID" = :a1 AND ROWNUM <= 1   [["id", 166]]
SELECT "MY_SCHOOLS".* FROM "MY_SCHOOLS" WHERE "MY_SCHOOLS"."SCHOOL_ID" = :a1  ORDER BY created_at DESC  [["school_id", 166]]
SELECT "MY_SCHOOLS".* FROM "MY_SCHOOLS" WHERE "MY_SCHOOLS"."USER_ID" = :a1  ORDER BY created_at DESC  [["user_id", 2]]
SELECT * FROM (SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1  ORDER BY "USERS"."ID" ASC ) WHERE ROWNUM <= 1  [["id", 347]]