app/controllers/users_controller.rb

SELECT * FROM (SELECT  "USERS".* FROM "USERS" WHERE "USERS"."ID" = :a1  ORDER BY "USERS"."ID" ASC ) WHERE ROWNUM <= 1  [["id", 347]]
---
  def list
    @user=User.find(params[:id])